In [11]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [9]:
df.replace({'주소':{'대구':'대전'}}, inplace=True)
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대전  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [12]:
df['주소'] = df['주소'].replace({'대구':'대전'})
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대전  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [13]:
df.groupby('주소')

In [14]:
df.groupby('주소').get_group('광주')

     이름  주소  나이  점수      언어
번호
1번  김길동  광주  33  76  Python
5번  박길동  광주  21  60     NaN

In [15]:
df.groupby('주소').mean()

TypeError: agg function failed [how->mean,dtype->object]

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 1번 to 6번
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   주소      6 non-null      object
 2   나이      6 non-null      int64
 3   점수      6 non-null      int64
 4   언어      4 non-null      object
dtypes: int64(2), object(3)
memory usage: 288.0+ bytes

In [17]:
df.groupby('주소').mean(numeric_only=True)

      나이    점수
주소
광주  27.0  68.0
대전  25.0  99.0
서울  24.0  89.0

In [18]:
df.groupby('주소').size()

주소
광주    2
대전    2
서울    2
dtype: int64

In [19]:
df.groupby('주소').size()['광주']

np.int64(2)

In [20]:
df.groupby('주소')['나이'].mean()

주소
광주    27.0
대전    25.0
서울    24.0
Name: 나이, dtype: float64

In [22]:
df.groupby('주소')[['나이', '점수']].mean()

      나이    점수
주소
광주  27.0  68.0
대전  25.0  99.0
서울  24.0  89.0

In [23]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대전  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [24]:
df.groupby('주소').mean(numeric_only=True).sort_values('점수', ascending=False)

      나이    점수
주소
대전  25.0  99.0
서울  24.0  89.0
광주  27.0  68.0